Revit 2026 API

# ParameterTypeIdBoundaryRestraintRotY Property

---

"Y Spring Modulus"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId BoundaryRestraintRotY { get; }
```
```vb
Public Shared ReadOnly Property BoundaryRestraintRotY As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ BoundaryRestraintRotY {
	ForgeTypeId^ get ();
}
```
```fsharp
static member BoundaryRestraintRotY : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace